rails/models/thespoon-with-activerecord-563/app/controllers/restaurants_controller.rb

  def create
    @restaurant = Restaurant.new(restaurant_params)
    @restaurant.save
---
INSERT INTO "restaurants" ("name", "rating", "created_at", "updated_at", "address") VALUES (?, ?, ?, ?, ?)  [["name", "HogsHead"], ["rating", 5], ["created_at", "2020-11-16 22:52:08.686136"], ["updated_at", "2020-11-16 22:52:08.686136"], ["address", "London"]]

  def update
    @restaurant.update(restaurant_params)
---
UPDATE "restaurants" SET "name" = ?, "address" = ?, "updated_at" = ? WHERE "restaurants"."id" = ?  [["name", "Krua Thai"], ["address", "Melbourne"], ["updated_at", "2020-11-16 22:59:31.529902"], ["id", 2]]